GopalSaraf/Practicals/PSDL/include/proc/pic16lf1713.inc
// Register: NCO1CON
#define NCO1CON NCO1CON
NCO1CON                                  equ 049Eh
// bitfield definitions
NCO1CON_N1PFM_POSN                       equ 0000h
NCO1CON_N1PFM_POSITION                   equ 0000h
NCO1CON_N1PFM_SIZE                       equ 0001h
NCO1CON_N1PFM_LENGTH                     equ 0001h
NCO1CON_N1PFM_MASK                       equ 0001h
NCO1CON_N1POL_POSN                       equ 0004h
NCO1CON_N1POL_POSITION                   equ 0004h
NCO1CON_N1POL_SIZE                       equ 0001h
NCO1CON_N1POL_LENGTH                     equ 0001h
NCO1CON_N1POL_MASK                       equ 0010h
NCO1CON_N1OUT_POSN                       equ 0005h
NCO1CON_N1OUT_POSITION                   equ 0005h
NCO1CON_N1OUT_SIZE                       equ 0001h
NCO1CON_N1OUT_LENGTH                     equ 0001h
NCO1CON_N1OUT_MASK                       equ 0020h
NCO1CON_N1EN_POSN                        equ 0007h
NCO1CON_N1EN_POSITION                    equ 0007h
NCO1CON_N1EN_SIZE                        equ 0001h
NCO1CON_N1EN_LENGTH                      equ 0001h
NCO1CON_N1EN_MASK                        equ 0080h

// Register: NCO1CLK
#define NCO1CLK NCO1CLK
NCO1CLK                                  equ 049Fh
// bitfield definitions
NCO1CLK_N1CKS0_POSN                      equ 0000h
NCO1CLK_N1CKS0_POSITION                  equ 0000h
NCO1CLK_N1CKS0_SIZE                      equ 0001h
NCO1CLK_N1CKS0_LENGTH                    equ 0001h
NCO1CLK_N1CKS0_MASK                      equ 0001h
NCO1CLK_N1CKS1_POSN                      equ 0001h
NCO1CLK_N1CKS1_POSITION                  equ 0001h
NCO1CLK_N1CKS1_SIZE                      equ 0001h
NCO1CLK_N1CKS1_LENGTH                    equ 0001h
NCO1CLK_N1CKS1_MASK                      equ 0002h
NCO1CLK_N1PWS0_POSN                      equ 0005h
NCO1CLK_N1PWS0_POSITION                  equ 0005h
NCO1CLK_N1PWS0_SIZE                      equ 0001h
NCO1CLK_N1PWS0_LENGTH                    equ 0001h
NCO1CLK_N1PWS0_MASK                      equ 0020h
NCO1CLK_N1PWS1_POSN                      equ 0006h
NCO1CLK_N1PWS1_POSITION                  equ 0006h
NCO1CLK_N1PWS1_SIZE                      equ 0001h
NCO1CLK_N1PWS1_LENGTH                    equ 0001h
NCO1CLK_N1PWS1_MASK                      equ 0040h
NCO1CLK_N1PWS2_POSN                      equ 0007h
NCO1CLK_N1PWS2_POSITION                  equ 0007h
NCO1CLK_N1PWS2_SIZE                      equ 0001h
NCO1CLK_N1PWS2_LENGTH                    equ 0001h
NCO1CLK_N1PWS2_MASK                      equ 0080h
NCO1CLK_N1CKS_POSN                       equ 0000h
NCO1CLK_N1CKS_POSITION                   equ 0000h
NCO1CLK_N1CKS_SIZE                       equ 0004h
NCO1CLK_N1CKS_LENGTH                     equ 0004h
NCO1CLK_N1CKS_MASK                       equ 000Fh
NCO1CLK_N1PWS_POSN                       equ 0005h
NCO1CLK_N1PWS_POSITION                   equ 0005h
NCO1CLK_N1PWS_SIZE                       equ 0003h
NCO1CLK_N1PWS_LENGTH                     equ 0003h
NCO1CLK_N1PWS_MASK                       equ 00E0h

// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 0511h
// bitfield definitions
OPA1CON_OPA1PCH_POSN                     equ 0000h
OPA1CON_OPA1PCH_POSITION                 equ 0000h
OPA1CON_OPA1PCH_SIZE                     equ 0002h
OPA1CON_OPA1PCH_LENGTH                   equ 0002h
OPA1CON_OPA1PCH_MASK                     equ 0003h
OPA1CON_OPA1UG_POSN                      equ 0004h
OPA1CON_OPA1UG_POSITION                  equ 0004h
OPA1CON_OPA1UG_SIZE                      equ 0001h
OPA1CON_OPA1UG_LENGTH                    equ 0001h
OPA1CON_OPA1UG_MASK                      equ 0010h
OPA1CON_OPA1SP_POSN                      equ 0006h
OPA1CON_OPA1SP_POSITION                  equ 0006h
OPA1CON_OPA1SP_SIZE                      equ 0001h
OPA1CON_OPA1SP_LENGTH                    equ 0001h
OPA1CON_OPA1SP_MASK                      equ 0040h
OPA1CON_OPA1EN_POSN                      equ 0007h
OPA1CON_OPA1EN_POSITION                  equ 0007h
OPA1CON_OPA1EN_SIZE                      equ 0001h
OPA1CON_OPA1EN_LENGTH                    equ 0001h
OPA1CON_OPA1EN_MASK                      equ 0080h
OPA1CON_OPA1PCH0_POSN                    equ 0000h
OPA1CON_OPA1PCH0_POSITION                equ 0000h
OPA1CON_OPA1PCH0_SIZE                    equ 0001h
OPA1CON_OPA1PCH0_LENGTH                  equ 0001h
OPA1CON_OPA1PCH0_MASK                    equ 0001h
OPA1CON_OPA1PCH1_POSN                    equ 0001h
OPA1CON_OPA1PCH1_POSITION                equ 0001h
OPA1CON_OPA1PCH1_SIZE                    equ 0001h
OPA1CON_OPA1PCH1_LENGTH                  equ 0001h
OPA1CON_OPA1PCH1_MASK                    equ 0002h

// Register: OPA2CON
#define OPA2CON OPA2CON
OPA2CON                                  equ 0515h
// bitfield definitions
OPA2CON_OPA2PCH_POSN                     equ 0000h
OPA2CON_OPA2PCH_POSITION                 equ 0000h
OPA2CON_OPA2PCH_SIZE                     equ 0002h
OPA2CON_OPA2PCH_LENGTH                   equ 0002h
OPA2CON_OPA2PCH_MASK                     equ 0003h
OPA2CON_OPA2UG_POSN                      equ 0004h
OPA2CON_OPA2UG_POSITION                  equ 0004h
OPA2CON_OPA2UG_SIZE                      equ 0001h
OPA2CON_OPA2UG_LENGTH                    equ 0001h
OPA2CON_OPA2UG_MASK                      equ 0010h
OPA2CON_OPA2SP_POSN                      equ 0006h
OPA2CON_OPA2SP_POSITION                  equ 0006h
OPA2CON_OPA2SP_SIZE                      equ 0001h
OPA2CON_OPA2SP_LENGTH                    equ 0001h
OPA2CON_OPA2SP_MASK                      equ 0040h
OPA2CON_OPA2EN_POSN                      equ 0007h
OPA2CON_OPA2EN_POSITION                  equ 0007h
OPA2CON_OPA2EN_SIZE                      equ 0001h
OPA2CON_OPA2EN_LENGTH                    equ 0001h
OPA2CON_OPA2EN_MASK                      equ 0080h
OPA2CON_OPA2PCH0_POSN                    equ 0000h
OPA2CON_OPA2PCH0_POSITION                equ 0000h
OPA2CON_OPA2PCH0_SIZE                    equ 0001h
OPA2CON_OPA2PCH0_LENGTH                  equ 0001h
OPA2CON_OPA2PCH0_MASK                    equ 0001h
OPA2CON_OPA2PCH1_POSN                    equ 0001h
OPA2CON_OPA2PCH1_POSITION                equ 0001h
OPA2CON_OPA2PCH1_SIZE                    equ 0001h
OPA2CON_OPA2PCH1_LENGTH                  equ 0001h
OPA2CON_OPA2PCH1_MASK                    equ 0002h

